import { createHash } from 'crypto'
import { canLevelUp, xpRange } from '../lib/levelling.js'
import fetch from 'node-fetch'
import fs from 'fs'
const { levelling } = '../lib/levelling.js'
import moment from 'moment-timezone'
import { promises } from 'fs'
import { join } from 'path'
const time = moment.tz('Egypt').format('HH')
let wib = moment.tz('Egypt').format('HH:mm:ss')
//import db from '../lib/database.js'

let handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
    let d = new Date(new Date + 3600000)
    let locale = 'ar'
    let week = d.toLocaleDateString(locale, { weekday: 'long' })
    let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
    let _uptime = process.uptime() * 1000
    let uptime = clockString(_uptime)
    let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
    if (!(who in global.db.data.users)) throw `✳️ The user is not found in my database`
    let videoUrl = 'https://telegra.ph/file/7c77b8a46acc56bb05273.mp4';
    let vn = '.Menu.png';
    const user = global.db.data.users[m.sender];
    const {money, joincount} = global.db.data.users[m.sender];
    const {exp, limit, level, role} = 
        global.db.data.users[m.sender];
    let { min, xp, max } = xpRange(user.level, global.multiplier)
    let username = conn.getName(who)
    let math = max - xp
    let sn = createHash('md5').update(who).digest('hex')
    let totalreg = Object.keys(global.db.data.users).length;
    let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
    let more = String.fromCharCode(8206)
    let readMore = more.repeat(900) 
    const taguser = '@' +  m.sender.split('@s.whatsapp.net')[0];
    let str = `┓━ ╼━━━╃⌬〔〕𓆩🕸️SENKU BOT🕸️𓆪⌬╄━━━╾ ━┏
*♕┇❯ مـرحــبـا بــك یــا ${taguser}*

*≼👤≽ مـعـلــومـات الـبــوت╿↶*
━ ── • ⟐ • ── ━
*♕┇❯ اســم الـبــوت ❰ 𓆩🕸️SENKU BOT🕸️𓆪  お ‘ ❱*
*♕┇❯ وقــت الـتشـغـيــل : ⌊ ${uptime} ⌉╎*
*♕┇❯الـمـطـور :/https://wa.me/212658594530⌉╎* ⌉╎*
*♕┇❯ الـإصـدار : ⌊v3.5⌉╎*
*♕┇❯ مـنـصـة الـتشـغـيــل :  ⌊ toy ⌉╎*
*♕┇❯ يمكنك دعم البوت عن طريق كتابه .الدعم ⌉╎*

            ━ ── • 〄 • ── ━

*≼🏰≽ قـسـم المجموعات╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .جروبي⌉*
*🔥╎❯ .معلوم_الجروب⌉*
*🔥╎❯ .منشن⌉*
*🔥╎❯ .مخفي⌉*
*🔥╎❯ .طرد⌉*
*🔥╎❯ .اضافه⌉*
*🔥╎❯ .ترقيه⌉*
*🔥╎❯ .خفض⌉*
*🔥╎❯ .حذف⌉*
*🔥╎❯ .جروب⌉*
*🔥╎❯ .تغير_المغادره⌉*
*🔥╎❯ .تغير_الدخول⌉*
*🔥╎❯ .تغييرالصورة⌉*
*🔥╎❯ .تغيير_الوصف⌉*
*🔥╎❯ .تغيير_الاسم⌉*
*🔥╎❯ .لينك⌉*
*🔥╎❯ .رستر⌉*
*🔥╎❯ .المشرفين⌉*
*🔥╎❯ .انذار⌉*
*🔥╎❯ .الغاء_الانذار ⌉*
*🔥╎❯ .الانذارات⌉*
   ────── • 〄 • ──────
*≼📜≽ قـسـم الدين╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .ايه-الكرسي⌉*
*🔥╎❯ .الله⌉*
*🔥╎❯ .قران⌉*
*🔥╎❯ .سوره⌉*
*🔥╎❯ .سور⌉*
*🔥╎❯ .حديث⌉*
*🔥╎❯ .ذكر⌉*
   ────── • 〄 • ──────
   *≼💎≽ قـسـم البنك╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .البنك⌉*
*🔥╎❯ .راتب⌉*
*🔥╎❯ .هجوم⌉*
*🔥╎❯ .يومي⌉*
*🔥╎❯ .الماس⌉*
*🔥╎❯ .ترتيب⌉*
*🔥╎❯ .ايدي⌉*
*🔥╎❯ .لفل⌉*
*🔥╎❯ .تسجيل⌉*
*🔥╎❯ .الغاء_التسجيل⌉*
   ────── • 〄 • ──────
*≼⏬≽ قـسـم التحميل+البحث╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .فيديو⌉*
*🔥╎❯ .فيديو2⌉*
*🔥╎❯ .اغنيه⌉*
*🔥╎❯ .اغاني⌉*
*🔥╎❯ .شغل⌉*
*🔥╎❯ .شغل1⌉*
*🔥╎❯ .صورة ⌉*
*🔥╎❯ .طقم⌉*
*🔥╎❯ .طقم_اولاد⌉*
*🔥╎❯ .طقم_بنات⌉*
*🔥╎❯ .البحث⌉*
*🔥╎❯ .ويكيبيديا⌉*
*🔥╎❯ .تيك⌉*
*🔥╎❯ .تيك_صور⌉*
*🔥╎❯ .يوتيوب⌉*
*🔥╎❯ .بينترست⌉*
*🔥╎❯ .فيسبوك⌉*
*🔥╎❯ .تطبيق⌉*
*🔥╎❯ .انستا⌉*
*🔥╎❯ .خلفيه⌉*
*🔥╎❯ .ميديافاير⌉*
*🔥╎❯ .مانجا⌉*
*🔥╎❯ .فريبيك⌉*
*🔥╎❯ .جيف⌉*
*🔥╎❯ .بنت⌉*
   ────── • 〄 • ──────
*≼🕹≽ قـسـم الترفيه╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .اكس_او⌉*
*🔥╎❯ .احذف_اللعبه⌉*
*🔥╎❯ .تحدي⌉*
*🔥╎❯ .حرب⌉*
*🔥╎❯ .احزر⌉*
*🔥╎❯ .حظ⌉*
*🔥╎❯ .جميل⌉*
*🔥╎❯ .صفع⌉*
*🔥╎❯ .طبطبه⌉*
*🔥╎❯ .ورع⌉*
*🔥╎❯ .اهبل⌉*
*🔥╎❯ .خروف⌉*
*🔥╎❯ .انطق⌉*
*🔥╎❯ .نسبه⌉*
*🔥╎❯ .لو⌉*
*🔥╎❯ .تويت⌉*
*🔥╎❯ .تاج⌉*
*🔥╎❯ .سؤال⌉*
*🔥╎❯ .اسئلني⌉*
*🔥╎❯  كت⌉*
*🔥╎❯ .شطرنج⌉*
*🔥╎❯ .سلاحي*
*🔥╎❯ .علم⌉*
*🔥╎❯ .نصايح⌉*
*🔥╎❯ .علم⌉*
*🔥╎❯ .عكس⌉*
*🔥╎❯ .تويت⌉*
*🔥╎❯ .مراتي⌉*
*🔥╎❯ .فزوره⌉*
*🔥╎❯ .لغز⌉*
*🔥╎❯ .حروف⌉*
*🔥╎❯ .شخصيه⌉*
*🔥╎❯ .احرجني⌉*
*🔥╎❯ .خمن⌉*
*🔥╎❯ .فكك⌉*
*🔥╎❯ .المارد⌉*
*🔥╎❯ .ايمو⌉*
*🔥╎❯ .دين⌉*
*🔥╎❯ .كوره⌉*
*🔥╎❯ .رياضيات⌉*
   ────── • 〄 • ──────
*≼♻️≽ قـسـم التحويل╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .ملصق⌉*
*🔥╎❯ .حقوق⌉*
*🔥╎❯ .لصورة⌉*
*🔥╎❯ .لفيديو⌉*
*🔥╎❯ .دائري⌉*
*🔥╎❯ .لرابط⌉*
*🔥╎❯ .لصوت⌉*
*🔥╎❯ .لريك⌉*
*🔥╎❯ .تيلجرام⌉*
*🔥╎❯ .حيوان⌉*
*🔥╎❯ .قط⌉*
*🔥╎❯ .كلب⌉*
*🔥╎❯ .ستك⌉*
*🔥╎❯ .لملف⌉*
*🔥╎❯ .نرد⌉*
*🔥╎❯ .لانمي⌉*
*🔥╎❯ .ارسم⌉*
   ────── • 〄 • ──────
*≼🖇️≽ قـسـم الادوات╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .لرابط⌉*
*🔥╎❯ .باركود⌉*
*🔥╎❯ .ترجمه⌉*
*🔥╎❯ .فضح⌉*
*🔥╎❯ .تفريغ⌉*
*🔥╎❯ .فحص⌉*
*🔥╎❯ .تكرار⌉*
*🔥╎❯ .بريد⌉*
*🔥╎❯ .قص⌉*
*🔥╎❯ .احسب⌉*
*🔥╎❯ .جوده⌉*
*🔥╎❯ .واتس⌉*
*🔥╎❯ .مطلوب⌉*
*🔥╎❯ .انسخ⌉*
*🔥╎❯ .بينغ⌉*
   ────── • 〄 • ──────
*≼🔊≽ قـسـم الصوتيات╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .عميق⌉*
*🔥╎❯ .منفوخ⌉*
*🔥╎❯ .تخين⌉*
*🔥╎❯ .صاخب⌉*
*🔥╎❯ .سريع⌉*
*🔥╎❯ .رفيع⌉*
*🔥╎❯ .روبوت⌉*
*🔥╎❯ .بطئ⌉*
*🔥╎❯ .ناعم⌉*
*🔥╎❯ .سنجاب⌉*
*🔥╎❯ .مكس⌉*
   ────── • 〄 • ──────
*≼🧞≽ قـسـم الاعضاء╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .اختفاء⌉*
*🔥╎❯ .ابلاغ⌉*
*🔥╎❯ .تحدث⌉* 
*🔥╎❯ .بوت⌉*
*🔥╎❯ .بينغ⌉*
*🔥╎❯ .بروفايل⌉*
*🔥╎❯ .منشن⌉*
*🔥╎❯ .سرعه⌉*
*🔥╎❯ .خط⌉*
*🔥╎❯ .دمج⌉*
*🔥╎❯ .هل⌉*
*🔥╎❯ .منشني⌉*
*🔥╎❯ .توب⌉*
*🔥╎❯ .تصاميم⌉*
*🔥╎❯ .تصميم⌉*
*🔥╎❯ .المطور⌉*
*🔥╎❯ .تسجيل⌉*
*🔥╎❯ .جوجل⌉*
*🔥╎❯ .تعليق⌉*
*🔥╎❯ .ايديت⌉*
*🔥╎❯ .الاستماره⌉*
*🔥╎❯ .الدعم⌉*
*🔥╎❯ .الطقس⌉*
*🔥╎❯ .بوست⌉*
*🔥╎❯ .عبارات⌉*
*🔥╎❯ .رابطي⌉*
*🔥╎❯ .السورس⌉*
*🔥╎❯ .قوانين⌉*
*🔥╎❯ .المعرف⌉*
*🔥╎❯ .المستخدمين⌉*
   ────── • 〄 • ──────
*≼🧧≽ قـسـم المطور╿↶*
*⋄━───═◞⬪⋇⬪◟═───━⋄*
*🔥╎❯ .بان⌉*
*🔥╎❯ .بان_فك⌉*
*🔥╎❯ .بان_شات⌉*
*🔥╎❯ .بان_شات_فك⌉*
*🔥╎❯ .حطها بروفايل⌉*
*🔥╎❯ .ضيف_الماس⌉*
*🔥╎❯ .ضيف_اكسبي⌉*
*🔥╎❯ .اعاده⌉*
*🔥╎❯ .اخرج⌉*
*🔥╎❯ .ادخل⌉*
*🔥╎❯ .تهكير⌉*
*🔥╎❯ .تنظيف⌉*
*🔥╎❯ .الامردا⌉*
*🔥╎❯ .البلوكات⌉*
*🔥╎❯ .فك_البلوك⌉*
*🔥╎❯ .بلوك⌉*
*🔥╎❯ .بريم⌉*
*🔥╎❯ .حذف_بريم⌉*
*🔥╎❯ .المميزين⌉*
*🔥╎❯ .تسريع⌉*
*🔥╎❯ .نشر⌉*
*⋄━───═◞⬪قوانين⬪◟═───━⋄*
*🔥╎❯ ممنوع سب البوت لانك سبيت البوت = سبيت المطور*
*🔥╎❯ تمتع بالبوت ولا تكتر اسبام للبوت اذا كان لديك مشكله او تريد اضافه اوامر اخري جديده تواصل مع المطور*
*🔥╎❯ المطور wa.me/212658594530*
*┛━ ╼━━━╃⌬〔🔥〕⌬╄━━━╾ ┈┈⟢
    `.trim();

    

    conn.sendMessage(m.chat, {
        video: { url: videoUrl }, caption: str,
        mentions: [m.sender,global.conn.user.jid],
        gifPlayback: true,gifAttribution: 0
    }, { quoted: m });
}; 

handler.help = ['main']
handler.tags = ['group']
handler.command = ['اوامر'] 

export default handler

function clockString(ms) {
    let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
    let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
    let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')
}

function ucapan() {
    const time = moment.tz('Morocco ').format('HH')
    let res = "بداية يوم سعيده ☀️"
    if (time >= 4) {
        res = "صباح الخير 🌄"
    }
    if (time >= 10) {
        res = "مساء الخير ☀️"
    }
    if (time >= 15) {
        res = "مساء الخير 🌇"
    }
    if (time >= 18) {
        res = "مساء الخير 🌙"
    }
    return res
                }
